nfe_mais_certo.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao">
      <cUF>51</cUF>
      <versaoDados>3.10</versaoDados>
    </nfeCabecMsg>
  </soap12:Header>
  <soap12:Body>
    <NFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="3.10">
      <infNFe Id="NFe51150401882109000162550010000000031137628388" versao="3.10">
        <ide>
          <cUF>51</cUF>
          <cNF>13762838</cNF>
          <natOp>Venda de mercadoria</natOp>
          <indPag>0</indPag>
          <mod>55</mod>
          <serie>1</serie>
          <nNF>3</nNF>
          <dhEmi>2015-04-30T17:45:00-03:00</dhEmi>
          <dhSaiEnt>2015-04-30T17:45:00-03:00</dhSaiEnt>
          <tpNF>1</tpNF>
          <idDest>1</idDest>
          <cMunFG>5103403</cMunFG>
          <tpImp>1</tpImp>
          <tpEmis>1</tpEmis>
          <cDV>8</cDV>
          <tpAmb>2</tpAmb>
          <finNFe>1</finNFe>
          <indFinal>1</indFinal>
          <indPres>1</indPres>
          <procEmi>0</procEmi>
          <verProc>nfcelular v1</verProc>
        </ide>
        <emit>
          <CNPJ>01882109000162</CNPJ>
          <xNome>COXIPO COM PROD PAPELARIA IMP EXPORTACAO LTDA EPP</xNome>
          <xFant>COXIPO</xFant>
          <enderEmit>
            <xLgr>AVENIDA TENENTE-CORONEL DUARTE</xLgr>
            <nro>191</nro>
            <xBairro>CENTRO NORTE</xBairro>
            <cMun>5103403</cMun>
            <xMun>Cuiaba</xMun>
            <UF>MT</UF>
            <CEP>78005500</CEP>
            <cPais>1058</cPais>
            <xPais>Brasil</xPais>
            <fone>6533171500</fone>
          </enderEmit>
          <IE>130333573</IE>
          <CRT>3</CRT>
        </emit>
        <dest>
          <CNPJ>99999999000191</CNPJ>
          <xNome>NF-E EMITIDA EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL</xNome>
          <enderDest>
            <xLgr>Rua Test</xLgr>
            <nro>80</nro>
            <xBairro>Vila Test</xBairro>
            <cMun>5103403</cMun>
            <xMun>Cuiaba</xMun>
            <UF>MT</UF>
            <CEP>03978300</CEP>
            <cPais>1058</cPais>
            <xPais>Brasil</xPais>
            <fone>91095751</fone>
          </enderDest>
          <indIEDest>9</indIEDest>
          <email>marculo.henrique@gmail.com</email>
        </dest>
        <det nItem="1">
          <prod>
            <cProd>008</cProd>
            <cEAN />
            <xProd>Test</xProd>
            <NCM>85176130</NCM>
            <EXTIPI>00</EXTIPI>
            <CFOP>5102</CFOP>
            <uCom>UN</uCom>
            <qCom>1.0000</qCom>
            <vUnCom>600.0000000000</vUnCom>
            <vProd>600.00</vProd>
            <cEANTrib />
            <uTrib>UN</uTrib>
            <qTrib>1.0000</qTrib>
            <vUnTrib>600.0000000000</vUnTrib>
            <indTot>1</indTot>
            <xPed>2</xPed>
            <nItemPed>1</nItemPed>
          </prod>
          <imposto>
            <vTotTrib>185.82</vTotTrib>
            <ICMS>
              <ICMS00>
                <orig>0</orig>
                <CST>00</CST>
                <modBC>0</modBC>
                <vBC>600.00</vBC>
                <pICMS>0.00</pICMS>
                <vICMS>0.00</vICMS>
              </ICMS00>
            </ICMS>
            <PIS>
              <PISAliq>
                <CST>01</CST>
                <vBC>600.00</vBC>
                <pPIS>0.00</pPIS>
                <vPIS>0.00</vPIS>
              </PISAliq>
            </PIS>
            <COFINS>
              <COFINSAliq>
                <CST>01</CST>
                <vBC>600.00</vBC>
                <pCOFINS>0.00</pCOFINS>
                <vCOFINS>0.00</vCOFINS>
              </COFINSAliq>
            </COFINS>
          </imposto>
        </det>
        <total>
          <ICMSTot>
            <vBC>600.00</vBC>
            <vICMS>0.00</vICMS>
            <vICMSDeson>0.00</vICMSDeson>
            <vBCST>0.00</vBCST>
            <vST>0.00</vST>
            <vProd>600.00</vProd>
            <vFrete>0.00</vFrete>
            <vSeg>0.00</vSeg>
            <vDesc>0.00</vDesc>
            <vII>0.00</vII>
            <vIPI>0.00</vIPI>
            <vPIS>0.00</vPIS>
            <vCOFINS>0.00</vCOFINS>
            <vOutro>0.00</vOutro>
            <vNF>600.00</vNF>
            <vTotTrib>185.82</vTotTrib>
          </ICMSTot>
        </total>
        <transp>
          <modFrete>9</modFrete>
        </transp>
        <infAdic>
          <infCpl>[Trib aprox: Fed R$ 83,82 (13,97%), Est R$ 102,00 (17,00%). Fonte: IBPT/MT - 9oi3aC]</infCpl>
        </infAdic>
      </infNFe>
    </NFe>
    <protNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="3.10">
      <infProt>
        <tpAmb>2</tpAmb>
        <verAplic>3.10</verAplic>
        <chNFe>51150401882109000162550010000000021137628398</chNFe>
        <dhRecbto>2015-04-30T15:45:00-04:00</dhRecbto>
        <nProt>151150001628063</nProt>
        <digVal>IsaXnwN/mt5BP3DeDCe/7DMUd0o=</digVal>
        <cStat>100</cStat>
        <xMotivo>Autorizado o uso da NF-e</xMotivo>
      </infProt>
    </protNFe>
  </soap12:Body>
</soap12:Envelope>